---
kind: property
id: P:Autodesk.Revit.DB.MaterialNode.Transparency
source: html/837ec440-5bc5-384d-5f03-54c83c81692c.htm
---
# Autodesk.Revit.DB.MaterialNode.Transparency Property

The value of transparency the material is being rendered with

## Syntax (C#)
```csharp
public double Transparency { get; }
```